## Pandas (Contd..)

- Date Manipulation
- Work with strings
- Join dataframes

In [1]:
import pandas as pd
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/stores.csv"
store = pd.read_csv(path)

In [2]:
store.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,11-09-2013,11-12-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,11-09-2013,11-12-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [3]:
### Month
### Year
### Weekday
### Duration

In [4]:
store.dtypes

Row ID             int64
Order ID          object
Order Date        object
Ship Date         object
Ship Mode         object
Customer ID       object
Customer Name     object
Segment           object
Country           object
City              object
State             object
Postal Code        int64
Region            object
Product ID        object
Category          object
Sub-Category      object
Product Name      object
Sales            float64
Quantity           int64
Discount         float64
Profit           float64
dtype: object

In [5]:
store['Order Date']=pd.to_datetime(store['Order Date'])

In [7]:
store['Ship Date'] = pd.to_datetime(store['Ship Date'])

In [9]:
store.dtypes

Row ID                    int64
Order ID                 object
Order Date       datetime64[ns]
Ship Date        datetime64[ns]
Ship Mode                object
Customer ID              object
Customer Name            object
Segment                  object
Country                  object
City                     object
State                    object
Postal Code               int64
Region                   object
Product ID               object
Category                 object
Sub-Category             object
Product Name             object
Sales                   float64
Quantity                  int64
Discount                float64
Profit                  float64
dtype: object

In [10]:
store['Order Date'].dt.year

0       2013
1       2013
2       2013
3       2012
4       2012
        ...
9989    2011
9990    2014
9991    2014
9992    2014
9993    2014
Name: Order Date, Length: 9994, dtype: int64

In [11]:
store['Order Date'].dt.month

0       11
1       11
2        6
3       10
4       10
        ..
9989     1
9990     2
9991     2
9992     2
9993     5
Name: Order Date, Length: 9994, dtype: int64

In [12]:
store['Order Date'].dt.weekday ###0-> Monday, 6->Sunday

0       5
1       5
2       3
3       3
4       3
       ..
9989    5
9990    3
9991    3
9992    3
9993    0
Name: Order Date, Length: 9994, dtype: int64

### Class Excercise: Flight Delays Dataset

**Load the data set FlightDelays, the data has information on the flights over the year 2004 and if a particular flight was delayed or not**

1. Find out the number of delayed flights for all weekdays,
2. Find the average distance, total distance and count for all delayed flights on Friday
3. Find out how many flights were on time on Week days and Weekends (Consider Saturday and Sunday as weekends)
4. Find out the number of flights for each destination across all weekdays
5. Find out the number of times weather was bad across all weekdays. (1 indicates bad weather)

In [13]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/FlightDelays.csv"
fd = pd.read_csv(path)
fd.head(2)

,schedtime,carrier,deptime,dest,distance,date,flightnumber,origin,weather,tailnu,delay
0,1455,OH,1455,JFK,184,01-01-2004,5935,BWI,0,N940CA,ontime
1,1640,DH,1640,JFK,213,01-01-2004,6155,DCA,0,N405FJ,ontime

In [14]:
fd['date'] = pd.to_datetime(fd['date'])

In [16]:
fd['day_of_week']=fd['date'].dt.weekday ## 0-> Monday, 6->Sunday

In [19]:
##Q1
fd.query("day_of_week<5 and delay!='ontime'").shape[0]

336

In [21]:
##Q2
fd.query("delay=='delayed' and day_of_week==4").shape[0] ## count

75

In [23]:
fd.query("delay=='delayed' and day_of_week==4")['distance'].sum()

15771

In [24]:
fd.query("delay=='delayed' and day_of_week==4")['distance'].mean()

210.28

In [26]:
fd.query("delay=='delayed' and day_of_week==4").agg({'distance':['sum','mean','count']})

       distance
sum    15771.00
mean     210.28
count     75.00

In [27]:
##Q3
#weekdays
fd.query("delay=='ontime' and day_of_week<5").shape[0]

1362

In [28]:
## weekends
fd.query("delay=='ontime' and day_of_week>=5").shape[0]

411

In [30]:
##Q4
fd.query("day_of_week<5").groupby('dest').agg({'dest':'count'})

      dest
dest
EWR    507
JFK    272
LGA    919

In [31]:
##Q5
fd.query("weather==1 and day_of_week<5").shape[0]

30

In [32]:
store.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

- if sales>5000, high
- if 2000=<sales<=5000, medium
- if sales<2000, low

map(f,iterable)

In [33]:
def cat_sales(x):
    result = None
    if x > 5000:
        result =  "high"
    elif x<=5000 and x>=2000:
        result =  "medium"
    else:
        result =  "low"
    return result

In [37]:
store['sales_cat']=store['Sales'].map(cat_sales)

In [38]:
store.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,sales_cat
0,1,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136,low
1,2,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820,low

In [39]:
url = "https://raw.githubusercontent.com/Gunnvant/corp_trainings/main/tiger_analytics/data/comey.csv"

In [41]:
comey = pd.read_csv(url, encoding="latin1")

In [42]:
comey.head()

,Senator,Party Affiliation,Full Question,Comey,Comey Response
0,BURR,Republican,Do you have any doubt that Russia attempted to...,COMEY,None.
1,BURR,Republican,Do you have any doubt that the Russian governm...,COMEY,"No, no doubt."
2,BURR,Republican,Do you have any doubt the Russian government w...,COMEY,No.
3,BURR,Republican,Are you confident that no votes cast in the 20...,COMEY,I'm confident. When I left as director I had s...
4,BURR,Republican,"Director Comey, did the president at any time ...",COMEY,"Not to my understanding, no."

In [45]:
### Is there any difference in the length of questions asked by people from diff political parties
comey['Full Question']

0      Do you have any doubt that Russia attempted to...
1      Do you have any doubt that the Russian governm...
2      Do you have any doubt the Russian government w...
3      Are you confident that no votes cast in the 20...
4      Director Comey, did the president at any time ...
                             ...
293    So both President Trump and former candidate C...
294                              Why didn't you ask him?
295    Yeah, but I think it would intensity arouse my...
296    We would have had conversation if that happene...
297    But you reached that conclusion as far as Secr...
Name: Full Question, Length: 298, dtype: object

In [46]:
def get_len(x):
    bow = x.split()
    return len(bow)

In [48]:
comey['ques_len'] = comey["Full Question"].map(get_len)

In [49]:
comey.head(2)

,Senator,Party Affiliation,Full Question,Comey,Comey Response,ques_len
0,BURR,Republican,Do you have any doubt that Russia attempted to...,COMEY,None.,14
1,BURR,Republican,Do you have any doubt that the Russian governm...,COMEY,"No, no doubt.",26

In [50]:
comey.groupby('Party Affiliation').agg({'ques_len':'mean'})

                    ques_len
Party Affiliation
Democrat           37.236364
Independent        29.500000
Republican         39.839286

In [52]:
store.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,sales_cat
0,1,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136,low
1,2,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820,low

In [53]:
store['Ship Mode'].unique()

array(['Second Class', 'Standard Class', 'First Class', 'Same Day'],
      dtype=object)

`First Class` costs more and we need to adjust the sales figure downwards by 200 in case
the ship mode is `First Class`

In [54]:
def correction(row):
    if row['Ship Mode']=='First Class':
        res = row['Sales'] = row['Sales']-200
    else:
        res = row['Sales']
    return res

store.apply(correction,axis = 1)

### Joins

In [57]:
path = "https://raw.githubusercontent.com/Gunnvant/corp_trainings/main/tiger_analytics/data/customers.csv"
customers = pd.read_csv(path)
path = "https://raw.githubusercontent.com/Gunnvant/corp_trainings/main/tiger_analytics/data/accounts.csv"
accounts = pd.read_csv(path)

In [58]:
customers

  Cust_id  Age
0     AA1   17
1     AA2   18
2     AA3   33
3     AA4   21
4     AA5   14
5     AA6   81

In [59]:
accounts

  CustID Account Type
0    AA1          AAA
1    AA6           AA
2    AA4            B
3    AA7          CCC
4   AA12          AAA
5   AA10          DDD

In [60]:
## Inner
## Left outer
## Right outer
## Outer

In [61]:
## Inner
pd.merge(customers,accounts,how="inner",left_on="Cust_id",
        right_on = "CustID")

  Cust_id  Age CustID Account Type
0     AA1   17    AA1          AAA
1     AA4   21    AA4            B
2     AA6   81    AA6           AA

In [62]:
## Left
pd.merge(customers,accounts,how="left",left_on="Cust_id",
        right_on = "CustID")

  Cust_id  Age CustID Account Type
0     AA1   17    AA1          AAA
1     AA2   18    NaN          NaN
2     AA3   33    NaN          NaN
3     AA4   21    AA4            B
4     AA5   14    NaN          NaN
5     AA6   81    AA6           AA

In [63]:
## Right
pd.merge(customers,accounts,how="right",left_on="Cust_id",
        right_on = "CustID")

  Cust_id   Age CustID Account Type
0     AA1  17.0    AA1          AAA
1     AA6  81.0    AA6           AA
2     AA4  21.0    AA4            B
3     NaN   NaN    AA7          CCC
4     NaN   NaN   AA12          AAA
5     NaN   NaN   AA10          DDD

In [64]:
## outer
pd.merge(customers,accounts,how="outer",left_on="Cust_id",
        right_on = "CustID")

  Cust_id   Age CustID Account Type
0     AA1  17.0    AA1          AAA
1     AA2  18.0    NaN          NaN
2     AA3  33.0    NaN          NaN
3     AA4  21.0    AA4            B
4     AA5  14.0    NaN          NaN
5     AA6  81.0    AA6           AA
6     NaN   NaN    AA7          CCC
7     NaN   NaN   AA12          AAA
8     NaN   NaN   AA10          DDD

### Class Excercise (Joins)
    - Use the files contributions.csv and candidates.csv. The file contributions.csv contains data on contributions made to political parties. The file candidates.csv contains data on the demographics of candidates belonging to different political parties. What was the highest contribution made on a Sunday?
 
    - Use the files contributions.csv and candidates.csv. The file contributions.csv contains data on contributions made to political parties. The file candidates.csv contains data on the demographics of candidates belonging to different political parties. Is there a difference between the average donations received by Democrats on weekdays vs weekends? (In the column party, R stands for Republican and D stands for Democrats)
 
    - Use the files contributions.csv and candidates.csv. The file contributions.csv contains data on contributions made to political parties. The file candidates.csv contains data on the demographics of candidates belonging to different political parties. The highest amount contributed on weekdays towards Democrats is?  (In the column party, R stands for Republican and D stands for Democrats)

In [65]:
path1 = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/candidates.csv"
path2 = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/contributions.csv"
candidates = pd.read_csv(path1)
contributions = pd.read_csv(path2)

In [66]:
candidates.head(2)

   id first_name  last_name middle_name party
0  33     Joseph      Biden         NaN     D
1  36     Samuel  Brownback         NaN     R

In [67]:
contributions.head(2)

,id,last_name,first_name,middle_name,street_1,street_2,city,state,zip,amount,date,candidate_id
0,NaN,Agee,Steven,NaN,549 Laurel Branch Road,NaN,Floyd,VA,24091,500.0,2007-06-30,16
1,NaN,Ahrens,Don,NaN,4034 Rennellwood Way,NaN,Pleasanton,CA,94566,250.0,2007-05-16,16

In [68]:
contributions['date'] = pd.to_datetime(contributions['date'])

In [69]:
contributions['day_of_week'] = contributions['date'].dt.weekday

In [70]:
contributions.head(2)

,id,last_name,first_name,middle_name,street_1,street_2,city,state,zip,amount,date,candidate_id,day_of_week
0,NaN,Agee,Steven,NaN,549 Laurel Branch Road,NaN,Floyd,VA,24091,500.0,2007-06-30,16,5
1,NaN,Ahrens,Don,NaN,4034 Rennellwood Way,NaN,Pleasanton,CA,94566,250.0,2007-05-16,16,2

In [72]:
contributions.query("day_of_week==6")['amount'].max()

2300.0

In [73]:
contributions.head(2)

,id,last_name,first_name,middle_name,street_1,street_2,city,state,zip,amount,date,candidate_id,day_of_week
0,NaN,Agee,Steven,NaN,549 Laurel Branch Road,NaN,Floyd,VA,24091,500.0,2007-06-30,16,5
1,NaN,Ahrens,Don,NaN,4034 Rennellwood Way,NaN,Pleasanton,CA,94566,250.0,2007-05-16,16,2

In [75]:
def get_weekday(x):
    if x<5:
        return "weekday"
    else:
        return "weekend"
contributions['weekend']=contributions['day_of_week'].map(get_weekday)

In [76]:
contributions.head(2)

,id,last_name,first_name,middle_name,street_1,street_2,city,state,zip,amount,date,candidate_id,day_of_week,weekend
0,NaN,Agee,Steven,NaN,549 Laurel Branch Road,NaN,Floyd,VA,24091,500.0,2007-06-30,16,5,weekend
1,NaN,Ahrens,Don,NaN,4034 Rennellwood Way,NaN,Pleasanton,CA,94566,250.0,2007-05-16,16,2,weekday

In [80]:
comb = pd.merge(candidates,contributions,how="right",left_on="id",right_on="candidate_id")

In [83]:
comb.query("party=='D'").groupby('weekend').agg({'amount':'mean'})

             amount
weekend
weekday  229.185714
weekend  431.261250

In [86]:
comb.query("party=='D' and weekend == 'weekday'")['amount'].max()

4600.0

Use the dataset stored [here](https://github.com/Gunnvant/corp_trainings/blob/version2/tiger_analytics/Session2/class_exercise/writeup.md). The description of this dataset can be read from [here](https://github.com/Gunnvant/corp_trainings/blob/version2/tiger_analytics/Session2/class_exercise/writeup.md)

Answer the questions raised below:
1. How many incidents were reported for the month of March?
    
    A.	54
    B.	45
    C.	35
    D.	25

2. On an average how many hectares of area was destroyed by the fires in the month of August? 
   
    A.	12.48
    B.	12.67
    C.	12.40
    D.	11.48

3. In the month of August, what was the week-day, when the area destroyed in the fires was maximum but the temperature was least.
   
    A.	Monday
    B.	Tuesday
    C.	Thursday
    D.	Wednesday

4. Maximum rainfall happened on:
   
    A.	Tuesday
    B.	Monday
    C.	Sunday
    D.	Friday

In [87]:
path = "/Users/gunnvantsaini/Downloads/forest_fires.csv"
forest = pd.read_csv(path)

In [88]:
forest.head()

   X  Y month  day  FFMC   DMC     DC  ISI  temp  RH  wind  rain  area
0  7  5   mar  fri  86.2  26.2   94.3  5.1   8.2  51   6.7   0.0   0.0
1  7  4   oct  tue  90.6  35.4  669.1  6.7  18.0  33   0.9   0.0   0.0
2  7  4   oct  sat  90.6  43.7  686.9  6.7  14.6  33   1.3   0.0   0.0
3  8  6   mar  fri  91.7  33.3   77.5  9.0   8.3  97   4.0   0.2   0.0
4  8  6   mar  sun  89.3  51.3  102.2  9.6  11.4  99   1.8   0.0   0.0

In [89]:
##Q1
forest.query("month=='mar'").shape[0]

54

In [90]:
forest['month'].unique()

array(['mar', 'oct', 'aug', 'sep', 'apr', 'jun', 'jul', 'feb', 'jan',
       'dec', 'may', 'nov'], dtype=object)

In [92]:
##q2
forest.query("month=='aug'")['area'].mean()

12.489076086956521

In [94]:
##Q3
forest.query("month=='aug'").sort_values(['area','temp'],ascending=[False,True]).head(1)

     X  Y month  day  FFMC    DMC     DC   ISI  temp  RH  wind  rain    area
415  8  6   aug  thu  94.8  222.4  698.6  13.9  27.5  27   4.9   0.0  746.28

In [97]:
##Q4
forest[forest['rain']==forest['rain'].max()]['day']

499    tue
Name: day, dtype: object